IRP/src/Catalogs/AgingPeriods/AgingPeriods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>AgingPeriods</name>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>OverduePeriods</name>
  <attributes>
   <name>FromDays</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ToDays</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>Presentation</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>30</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>FuturePeriods</name>
  <attributes>
   <name>FromDays</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ToDays</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>Presentation</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>30</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/AgingPeriods/ObjectModule.bsl
Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	CheckPeriods(Cancel, "OverduePeriods");
	CheckPeriods(Cancel, "FuturePeriods");
EndProcedure

Procedure CheckPeriods(Cancel, TabularSectionName)
	PrevToDays = Undefined;
	LastLineNumber = ThisObject[TabularSectionName][ThisObject[TabularSectionName].Count()-1].LineNumber;
	For Each Row In ThisObject[TabularSectionName] Do
		If Row.LineNumber  = LastLineNumber and Row.ToDays <> 0 Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(R().Error_197, 
			TabularSectionName+"[" + Format((Row.LineNumber - 1), "NZ=0; NG=0;") + "].ToDays", ThisObject);
		EndIf;	
		If Row.FromDays > Row.ToDays and Row.LineNumber <> LastLineNumber  Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().Error_194, Row.FromDays, Row.ToDays), 
			TabularSectionName+"[" + Format((Row.LineNumber - 1), "NZ=0; NG=0;") + "].ToDays", ThisObject);
		EndIf;
		If PrevToDays <> Undefined And Row.FromDays - 1 > PrevToDays Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(R().Error_195, 
			TabularSectionName+"[" + Format((Row.LineNumber - 1), "NZ=0; NG=0;") + "].FromDays", ThisObject);
		EndIf;
		If PrevToDays <> Undefined And Row.FromDays <= PrevToDays Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(R().Error_196, 
			TabularSectionName+"[" + Format((Row.LineNumber - 1), "NZ=0; NG=0;") + "].FromDays", ThisObject);
		EndIf;
		PrevToDays = Row.ToDays;
	EndDo;		
EndProcedure
